// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
Console.Clear();

Console.Write("Введите координату A: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите координату B: ");
int b = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите координату C: ");
int c = Convert.ToInt32(Console.ReadLine());

System.Console.WriteLine(a; b; c);